---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions
source: html/3aa9bc3b-5ce0-e0ba-4211-9a08526c1c1b.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions

This class contains the options used to calculate extrusions from Revit geometry.

## Syntax (C#)
```csharp
public class IFCExtrusionCalculatorOptions : IDisposable
```